Revit 2024 API
AnalysisDisplayDeformedShapeSettings Constructor
 Constructs a default instance of deformed shape settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public AnalysisDisplayDeformedShapeSettings()
Visual Basic
Public Sub New
Visual C++
public:
AnalysisDisplayDeformedShapeSettings()
See Also
AnalysisDisplayDeformedShapeSettings Class
AnalysisDisplayDeformedShapeSettings Overload
Autodesk.Revit.DB.Analysis Namespace